import 'dart:math';
import 'package:aastu_ecsf/feed_screen/blog_detail.dart';
import 'package:flutter/material.dart';
import 'package:aastu_ecsf/feed_screen/list_news_light_adapter.dart';
import 'package:aastu_ecsf/data/dummy.dart';
import 'package:aastu_ecsf/data/my_colors.dart';
import 'package:aastu_ecsf/model/news.dart';
import 'package:aastu_ecsf/widget/my_toast.dart';

class ListNewsLightRoute extends StatefulWidget {
  ListNewsLightRoute();

  @override
  ListNewsLightRouteState createState() => new ListNewsLightRouteState();
}

class ListNewsLightRouteState extends State<ListNewsLightRoute> {
  late BuildContext context;

  // void moveTo() {
  //   Navigator.push<dynamic>(
  //     context,
  //     MaterialPageRoute<dynamic>(
  //       builder: (BuildContext context) => BlogDetail(),
  //     ),
  //   );
  // }

  @override
  Widget build(BuildContext context) {
    this.context = context;
    const List<String> all_images = [
      "blog_1.jpg",
      "blog_2.jpg",
      "blog_3.jpg",
      "blog_4.jpg",
    ];
    const List<String> strings_medium = [
      "ኢየሱስ? ወይስ ሞት? - ሰው እውነትን የሚያውቀው እግዚአብሔርን በክርስቶስ ባወቀ ጊዜ ብቻ ነው።",
      "ፍጹም ደስታ፣ ከሁኔታ በላይ የሆነ ሰላምና እውነተኛ መከናወን ያለው በእርሱ ፈቃድ ውስጥ ለተገኘ ሰው ነው። ",
      "መስቀሉ፦ ሲሞን ቬይ",
      "በዚያ ያለውን እንድታደራጅ ተውሁህ!"
    ];
    const List<String> description = [
      "1. ሰው በምድር ቈይታው፣ ገና ሳይጨልምና ሩጫው ሳይቋጭ ከሁለቱ ምርጫዎች አንዱን በቀጥታም ይሁን በተዘዋዋሪ መርጦ ይኖራል። ኢየሱስ ወይም ሞትን ይመርጣል። ምርጫውም እስትንፋሳቸው ላልተለያቸው ብቻ የሚሠራ ነው፤ ማንም በሲዖል ወይም በሰማይ ሆኖ ይህን ወይም ያንን ብሎ ሊመርጥ አይችልም፤ በቍሙ የመረጠው ምርጫ ግን ከሁለቱ በአንዱ ነዋሪ እንዲሆን ያደርገዋል። ሰው ሁሉ ከሁለቱ በአንዱ መርከብ ላይ ተሣፋሪ ነው፤ ወይ በኢየሱስ ወደ ዘላለም ሕይወትና ዕረፍት በየዕለቱ እየቀረበና እየተዘጋጀ ይጓዛል፤ ወይም ካለ ኢየሱስ ወደ ዘለዓለም ሞትና ቅጣት ይገሰግሳል። “ልጁ ያለው ሕይወት አለው፤ የእግዚአብሔር ልጅ የሌለው ሕይወት የለውም።” (1 ዮሐንስ 5፥12)።]\n በምንኖርባት ዓለም ብዙ ዕውቀቶችና ጥበባት፣ ብዙ እምነቶችና ፍልስፍናዎች፣ ሰዎችን እያስከተሉና እውነት የሚሉትን እየሰበኩ ነበሩ፤ ዛሬም አሉ። የሰው ልጆችም ይበጃናል ባሉትና ባመኑበት መንገድ እንዲሁም ከቤተ ሰብና ከአካባቢያቸው በወረሱት (በተማሩት) ልማድ በኵል እውነትንና መንፈሳዊ ደኅንነትን ይፈልጋሉ።\n አንድ ሰው በደረሰበት መረዳት ልክ ‘እውነት ነው’ ብሎ የሚቀበለው እምነት ይኖረዋል፤ ይህም አንጻራዊ እውነቱ ነው። ሆኖም ግን ቋሚ የሆነ አንድ እውነት አለ። ይህ ቋሚ እውነት ኢየሱስ ክርስቶስ ነው። ከእርሱ ውጪ የሆነውም ሁሉ ውሸት ነው።\nሰው እውነትን የሚያውቀው እግዚአብሔርን በክርስቶስ ባወቀ ጊዜ ብቻ ነው። እርሱ ራሱ እውነት መሆኑን የነገረንን ጌታ፣ ከሌሎች ጋር ዐብረን ‘እውነት’ ብንለው፣ እርሱን ውሸታም እናደርገዋለን፤ ከእርሱ በቀር ሌላ አማራጭ እውነት የለምና። እርሱ በቃሉ እንደነገረን፣ እኛም አምነን እንዳየነው ኢየሱስ ክርስቶስ ብቻውን እውነት ነው።\nእርሱ ሕይወትና ወደ ሕይወት መግቢያ በር፣ የመግቢያውም ብቸኛ ቁልፍ ነው። እውነት የሚመስሉና ለእውነቱ የተጠጉ ሌሎች ውሸቶች በየበኵላቸው መግቢያ እንደ ሆኑ ቢሰብኩንም፣ መዝጊያውን ከፍቶ ሊያስገባን የሚችለው ትክክለኛው ቁልፍ ኢየሱስ ብቻ ነው። “ኢየሱስም፦ እኔ መንገድና እውነት ሕይወትም ነኝ፤ በእኔ በቀር ወደ አብ የሚመጣ የለም።” (ዮሐንስ 14፥6)። \nከምናየውና ከምንሰማው ልዩ ልዩ ልምምድና እንቅስቃሴ የተነሣ ብዙ አማራጭ ያለ ቢመስልም፣ የዘላለም ሕይወት ርግጠኝነትን ለሰዎች ከማቀዳጀት አንጻር ያለው መንገድ፣ በኢየሱስ ክርስቶስና ኢየሱስ ክርስቶስ የሆነው ዘላለማዊ መንገድ ብቻ ነው። ከዚህ ውጭ ያለው መንገድ ሁሉ የሞት መንገድ ነው።",
      "2. ሰው በምድር ቈይታው፣ ገና ሳይጨልምና ሩጫው ሳይቋጭ ከሁለቱ ምርጫዎች አንዱን በቀጥታም ይሁን በተዘዋዋሪ መርጦ ይኖራል። ኢየሱስ ወይም ሞትን ይመርጣል። ምርጫውም እስትንፋሳቸው ላልተለያቸው ብቻ የሚሠራ ነው፤ ማንም በሲዖል ወይም በሰማይ ሆኖ ይህን ወይም ያንን ብሎ ሊመርጥ አይችልም፤ በቍሙ የመረጠው ምርጫ ግን ከሁለቱ በአንዱ ነዋሪ እንዲሆን ያደርገዋል። ሰው ሁሉ ከሁለቱ በአንዱ መርከብ ላይ ተሣፋሪ ነው፤ ወይ በኢየሱስ ወደ ዘላለም ሕይወትና ዕረፍት በየዕለቱ እየቀረበና እየተዘጋጀ ይጓዛል፤ ወይም ካለ ኢየሱስ ወደ ዘለዓለም ሞትና ቅጣት ይገሰግሳል። “ልጁ ያለው ሕይወት አለው፤ የእግዚአብሔር ልጅ የሌለው ሕይወት የለውም።” (1 ዮሐንስ 5፥12)።]\n በምንኖርባት ዓለም ብዙ ዕውቀቶችና ጥበባት፣ ብዙ እምነቶችና ፍልስፍናዎች፣ ሰዎችን እያስከተሉና እውነት የሚሉትን እየሰበኩ ነበሩ፤ ዛሬም አሉ። የሰው ልጆችም ይበጃናል ባሉትና ባመኑበት መንገድ እንዲሁም ከቤተ ሰብና ከአካባቢያቸው በወረሱት (በተማሩት) ልማድ በኵል እውነትንና መንፈሳዊ ደኅንነትን ይፈልጋሉ።\n አንድ ሰው በደረሰበት መረዳት ልክ ‘እውነት ነው’ ብሎ የሚቀበለው እምነት ይኖረዋል፤ ይህም አንጻራዊ እውነቱ ነው። ሆኖም ግን ቋሚ የሆነ አንድ እውነት አለ። ይህ ቋሚ እውነት ኢየሱስ ክርስቶስ ነው። ከእርሱ ውጪ የሆነውም ሁሉ ውሸት ነው።\nሰው እውነትን የሚያውቀው እግዚአብሔርን በክርስቶስ ባወቀ ጊዜ ብቻ ነው። እርሱ ራሱ እውነት መሆኑን የነገረንን ጌታ፣ ከሌሎች ጋር ዐብረን ‘እውነት’ ብንለው፣ እርሱን ውሸታም እናደርገዋለን፤ ከእርሱ በቀር ሌላ አማራጭ እውነት የለምና። እርሱ በቃሉ እንደነገረን፣ እኛም አምነን እንዳየነው ኢየሱስ ክርስቶስ ብቻውን እውነት ነው።\nእርሱ ሕይወትና ወደ ሕይወት መግቢያ በር፣ የመግቢያውም ብቸኛ ቁልፍ ነው። እውነት የሚመስሉና ለእውነቱ የተጠጉ ሌሎች ውሸቶች በየበኵላቸው መግቢያ እንደ ሆኑ ቢሰብኩንም፣ መዝጊያውን ከፍቶ ሊያስገባን የሚችለው ትክክለኛው ቁልፍ ኢየሱስ ብቻ ነው። “ኢየሱስም፦ እኔ መንገድና እውነት ሕይወትም ነኝ፤ በእኔ በቀር ወደ አብ የሚመጣ የለም።” (ዮሐንስ 14፥6)። \nከምናየውና ከምንሰማው ልዩ ልዩ ልምምድና እንቅስቃሴ የተነሣ ብዙ አማራጭ ያለ ቢመስልም፣ የዘላለም ሕይወት ርግጠኝነትን ለሰዎች ከማቀዳጀት አንጻር ያለው መንገድ፣ በኢየሱስ ክርስቶስና ኢየሱስ ክርስቶስ የሆነው ዘላለማዊ መንገድ ብቻ ነው። ከዚህ ውጭ ያለው መንገድ ሁሉ የሞት መንገድ ነው።",
      "3. ሰው በምድር ቈይታው፣ ገና ሳይጨልምና ሩጫው ሳይቋጭ ከሁለቱ ምርጫዎች አንዱን በቀጥታም ይሁን በተዘዋዋሪ መርጦ ይኖራል። ኢየሱስ ወይም ሞትን ይመርጣል። ምርጫውም እስትንፋሳቸው ላልተለያቸው ብቻ የሚሠራ ነው፤ ማንም በሲዖል ወይም በሰማይ ሆኖ ይህን ወይም ያንን ብሎ ሊመርጥ አይችልም፤ በቍሙ የመረጠው ምርጫ ግን ከሁለቱ በአንዱ ነዋሪ እንዲሆን ያደርገዋል። ሰው ሁሉ ከሁለቱ በአንዱ መርከብ ላይ ተሣፋሪ ነው፤ ወይ በኢየሱስ ወደ ዘላለም ሕይወትና ዕረፍት በየዕለቱ እየቀረበና እየተዘጋጀ ይጓዛል፤ ወይም ካለ ኢየሱስ ወደ ዘለዓለም ሞትና ቅጣት ይገሰግሳል። “ልጁ ያለው ሕይወት አለው፤ የእግዚአብሔር ልጅ የሌለው ሕይወት የለውም።” (1 ዮሐንስ 5፥12)።]\n በምንኖርባት ዓለም ብዙ ዕውቀቶችና ጥበባት፣ ብዙ እምነቶችና ፍልስፍናዎች፣ ሰዎችን እያስከተሉና እውነት የሚሉትን እየሰበኩ ነበሩ፤ ዛሬም አሉ። የሰው ልጆችም ይበጃናል ባሉትና ባመኑበት መንገድ እንዲሁም ከቤተ ሰብና ከአካባቢያቸው በወረሱት (በተማሩት) ልማድ በኵል እውነትንና መንፈሳዊ ደኅንነትን ይፈልጋሉ።\n አንድ ሰው በደረሰበት መረዳት ልክ ‘እውነት ነው’ ብሎ የሚቀበለው እምነት ይኖረዋል፤ ይህም አንጻራዊ እውነቱ ነው። ሆኖም ግን ቋሚ የሆነ አንድ እውነት አለ። ይህ ቋሚ እውነት ኢየሱስ ክርስቶስ ነው። ከእርሱ ውጪ የሆነውም ሁሉ ውሸት ነው።\nሰው እውነትን የሚያውቀው እግዚአብሔርን በክርስቶስ ባወቀ ጊዜ ብቻ ነው። እርሱ ራሱ እውነት መሆኑን የነገረንን ጌታ፣ ከሌሎች ጋር ዐብረን ‘እውነት’ ብንለው፣ እርሱን ውሸታም እናደርገዋለን፤ ከእርሱ በቀር ሌላ አማራጭ እውነት የለምና። እርሱ በቃሉ እንደነገረን፣ እኛም አምነን እንዳየነው ኢየሱስ ክርስቶስ ብቻውን እውነት ነው።\nእርሱ ሕይወትና ወደ ሕይወት መግቢያ በር፣ የመግቢያውም ብቸኛ ቁልፍ ነው። እውነት የሚመስሉና ለእውነቱ የተጠጉ ሌሎች ውሸቶች በየበኵላቸው መግቢያ እንደ ሆኑ ቢሰብኩንም፣ መዝጊያውን ከፍቶ ሊያስገባን የሚችለው ትክክለኛው ቁልፍ ኢየሱስ ብቻ ነው። “ኢየሱስም፦ እኔ መንገድና እውነት ሕይወትም ነኝ፤ በእኔ በቀር ወደ አብ የሚመጣ የለም።” (ዮሐንስ 14፥6)። \nከምናየውና ከምንሰማው ልዩ ልዩ ልምምድና እንቅስቃሴ የተነሣ ብዙ አማራጭ ያለ ቢመስልም፣ የዘላለም ሕይወት ርግጠኝነትን ለሰዎች ከማቀዳጀት አንጻር ያለው መንገድ፣ በኢየሱስ ክርስቶስና ኢየሱስ ክርስቶስ የሆነው ዘላለማዊ መንገድ ብቻ ነው። ከዚህ ውጭ ያለው መንገድ ሁሉ የሞት መንገድ ነው።",
      "4. ሰው በምድር ቈይታው፣ ገና ሳይጨልምና ሩጫው ሳይቋጭ ከሁለቱ ምርጫዎች አንዱን በቀጥታም ይሁን በተዘዋዋሪ መርጦ ይኖራል። ኢየሱስ ወይም ሞትን ይመርጣል። ምርጫውም እስትንፋሳቸው ላልተለያቸው ብቻ የሚሠራ ነው፤ ማንም በሲዖል ወይም በሰማይ ሆኖ ይህን ወይም ያንን ብሎ ሊመርጥ አይችልም፤ በቍሙ የመረጠው ምርጫ ግን ከሁለቱ በአንዱ ነዋሪ እንዲሆን ያደርገዋል። ሰው ሁሉ ከሁለቱ በአንዱ መርከብ ላይ ተሣፋሪ ነው፤ ወይ በኢየሱስ ወደ ዘላለም ሕይወትና ዕረፍት በየዕለቱ እየቀረበና እየተዘጋጀ ይጓዛል፤ ወይም ካለ ኢየሱስ ወደ ዘለዓለም ሞትና ቅጣት ይገሰግሳል። “ልጁ ያለው ሕይወት አለው፤ የእግዚአብሔር ልጅ የሌለው ሕይወት የለውም።” (1 ዮሐንስ 5፥12)።]\n በምንኖርባት ዓለም ብዙ ዕውቀቶችና ጥበባት፣ ብዙ እምነቶችና ፍልስፍናዎች፣ ሰዎችን እያስከተሉና እውነት የሚሉትን እየሰበኩ ነበሩ፤ ዛሬም አሉ። የሰው ልጆችም ይበጃናል ባሉትና ባመኑበት መንገድ እንዲሁም ከቤተ ሰብና ከአካባቢያቸው በወረሱት (በተማሩት) ልማድ በኵል እውነትንና መንፈሳዊ ደኅንነትን ይፈልጋሉ።\n አንድ ሰው በደረሰበት መረዳት ልክ ‘እውነት ነው’ ብሎ የሚቀበለው እምነት ይኖረዋል፤ ይህም አንጻራዊ እውነቱ ነው። ሆኖም ግን ቋሚ የሆነ አንድ እውነት አለ። ይህ ቋሚ እውነት ኢየሱስ ክርስቶስ ነው። ከእርሱ ውጪ የሆነውም ሁሉ ውሸት ነው።\nሰው እውነትን የሚያውቀው እግዚአብሔርን በክርስቶስ ባወቀ ጊዜ ብቻ ነው። እርሱ ራሱ እውነት መሆኑን የነገረንን ጌታ፣ ከሌሎች ጋር ዐብረን ‘እውነት’ ብንለው፣ እርሱን ውሸታም እናደርገዋለን፤ ከእርሱ በቀር ሌላ አማራጭ እውነት የለምና። እርሱ በቃሉ እንደነገረን፣ እኛም አምነን እንዳየነው ኢየሱስ ክርስቶስ ብቻውን እውነት ነው።\nእርሱ ሕይወትና ወደ ሕይወት መግቢያ በር፣ የመግቢያውም ብቸኛ ቁልፍ ነው። እውነት የሚመስሉና ለእውነቱ የተጠጉ ሌሎች ውሸቶች በየበኵላቸው መግቢያ እንደ ሆኑ ቢሰብኩንም፣ መዝጊያውን ከፍቶ ሊያስገባን የሚችለው ትክክለኛው ቁልፍ ኢየሱስ ብቻ ነው። “ኢየሱስም፦ እኔ መንገድና እውነት ሕይወትም ነኝ፤ በእኔ በቀር ወደ አብ የሚመጣ የለም።” (ዮሐንስ 14፥6)። \nከምናየውና ከምንሰማው ልዩ ልዩ ልምምድና እንቅስቃሴ የተነሣ ብዙ አማራጭ ያለ ቢመስልም፣ የዘላለም ሕይወት ርግጠኝነትን ለሰዎች ከማቀዳጀት አንጻር ያለው መንገድ፣ በኢየሱስ ክርስቶስና ኢየሱስ ክርስቶስ የሆነው ዘላለማዊ መንገድ ብቻ ነው። ከዚህ ውጭ ያለው መንገድ ሁሉ የሞት መንገድ ነው።",
    ];
    const List<String> news_category = ["Mekdi", "Biniyam", "Meri", "Abel"];
    const List<String> full_date = [
      "Dec 15, 2022",
      "Dec 15, 2022",
      "Dec 15, 2022",
      "Dec 15, 2022",
    ];

    Random random = Random();
    List<News> items = [];
    for (int i = 0; i < 4; i++) {
      News obj = News();
      obj.image = all_images[i];
      obj.title = strings_medium[i];
      obj.subtitle = news_category[i];
      obj.date = full_date[i];
      obj.description = description[i];
      items.add(obj);
    }

    void onItemClick(int index, News obj) {
      if (index >= 0 && index < items.length) {
        Navigator.push<dynamic>(
          context,
          MaterialPageRoute<dynamic>(
            builder: (BuildContext context) => DevoationDetail(
              idd: '',
            ),
          ),
        );
      } else {
        print('Invalid index');
      }

      // MyToast.show("News " + index.toString() + "clicked", context,
      //     duration: MyToast.LENGTH_SHORT);
    }

    return Scaffold(
      backgroundColor: const Color(0xff1f1f1f),
      body: CustomScrollView(
        slivers: <Widget>[
          SliverAppBar(
            pinned: true,
            backgroundColor: const Color(0xff121212),
            centerTitle: false,
            title: ShaderMask(
              shaderCallback: (bounds) => const LinearGradient(
                colors: [Color(0xffd1a552), Color.fromARGB(255, 209, 150, 82)],
                begin: Alignment.topLeft,
                end: Alignment.bottomRight,
              ).createShader(bounds),
              child: const Text(
                "Blogs",
                style: TextStyle(
                  fontFamily: 'MyBoldFont',
                  fontSize: 21,
                  fontWeight: FontWeight.bold,
                ),
              ),
            ),
            actions: <Widget>[
              IconButton(
                icon: const Icon(Icons.post_add, color: Color(0xff808080)),
                onPressed: () {},
              ),
              // overflow menu
            ],
          ),
          ListNewsLightAdapter(items, onItemClick).getView(),
        ],
      ),
    );
  }
}
